LFD is a decentralized and fair donation token issued by charitable organizations. Two simple public welfare mechanisms occur in every transaction: Passive income distribution, LP liquidity fund pool.
LuckyFortuneDog (LFD) is a unique charity community project at present. It combines the charity spirit of the East and the West. It will be officially launched in 2021 under the leadership of Gianni Liu. The LFD pass is a fully functional and decentralized digital asset built on the Binance Smart Chain (BscScan), with a total issuance of only one trillion. LFD has a reward mechanism for each transaction, and it can no longer be changed. Every community participant can query the transaction record of LFD on the Blockchain Browser.

TOKENOMICS
Name token: LuckyFortuneDog
Symbol: LFD
Decimals: 18
Maximum total supply: 1,000,000,000,000 LFD
BEP20 contract address밐0xdeb1EAF085979A73aB0E85901D786cBa991c2617
Passive income distribution
4% of each transaction is given to all holders as a static reward.
LP liquidity pool
1% of each transaction is automatically locked to increase liquidity of funds.

ROADMAP
Q3 2021
Protocol Initialized
Complete the construction of media and major marketing channels목establish relationships with non-profit organizations목 expand the team size under the leadership of Gianni Liu, join PancakeSwap for transactions목and build a large-scale charity ecological community
Q4 2021
High-Growth
Incorporate Italy/Milan office목Attend global conferences and become an industry leader in Italy목Initiate LFD exchange목New project designed on blockchain C LFD educational platform for charity purpose
Q1 2022
Expansion
Educational platform commercialised목LFD joins top crypto exchanges목Hold on-site charitable events목Business development with international charitable organisations
Q2 2022
Globalization
LFD exchange officially launched목Expand charity projects to a larger scale목Corporate footprint across the world

Where does LFD come from? 
The idea of LFD originated from the COVID-19 pandemic, which has caused uncountable families to lose their loved ones and many lovely dogs to lose their owners. Amid the catastrophe, a Chinese teenage boy born in Italy constructed a shelter and adopted two stray dogs, naming them Lucky and Fortune. The little boy, Gianni Liu, was born in December 2006, in the Chinese Year of the Dog. Gianni Liu몶s father is a public welfare worker at a local charity organization. Affected by his father몶s job, Gianni Liu has always been a very optimistic, cheerful kid, keen on helping homeless people and stray animals. He has participated in various charitable activities, including charity sales and volunteering at hospitals. After hearing about his father몶s concern for the risks and challenges faced by today몶s philanthropy industry, particularly the distrust issue between donors and organisations, Gianni hopes to form a concept model that will make charitable foundations more transparent, faster and more efficient. Gianni told his father: 몵Those who urgently need help are struggling to reach those who are willing to help, especially during the pandemic, where in-person charity events are not possible.몶 Therefore, he  launched  the 몵LuckyFortuneDog몶 project, named after the two stray dogs that he adopted last year, developing a platform that facilitates the connection between prospective donors and people in need. Gianni condensates the project into his motto: 몵 Wherever love is, there is fortune and prosperity.몶 

Why 1 trillion of total supply? 
Inspired by the business magnate, Mr Musk 몵s statement in April, 2021, Gianni asked his father if there was a chance to send his stray dogs or their offspring to Mars in Mr Musk몶s spaceship. He knew that there was very little hope for this dream to come true, like one in a trillion. His father told him to hold on with this faith and to keep working on it, despite the one in a trillion chance.  Thus, he decided to create 1 trillion LFD tokens, representing one in a trillion chance. The boy believes that with a collective effort from all caring people, the world will become a place where everyone can share borderless and endless love.

How does LFD achieve consensus?
LFD uses a unique and efficient consensus burning mechanism Proof-of-Stake (Proof of Stake), called public charity voting.  It is designed to allow people with LFD balances to choose any representatives they want to vote on behalf of the community without having to control their funds. The decentralized holders of LFD can decide who will generate social consensus instead of mining companies, which makes it easy to redistribute voting weight on a global scale. The voting process is very effective and is an important part of the free use of LFD and the destruction of tokens.